CSI API ETABS v1

# cPointObjGetCommonTo Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetCommonTo(
    	string Name,
    	ref int CommonTo
    )

    Function GetCommonTo (
    	Name As String,
    	ByRef CommonTo As Integer
    ) As Integer

    Dim instance As cPointObj
    Dim Name As String
    Dim CommonTo As Integer
    Dim returnValue As Integer

    returnValue = instance.GetCommonTo(Name,
    	CommonTo)

    int GetCommonTo(
    	String^ Name,
    	int% CommonTo
    )

    abstract GetCommonTo :
            Name : string *
            CommonTo : int byref -> int

#### Parameters

Name

    Type: SystemString

CommonTo

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cPointObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com